{"name":"Tinodaishe ",
"headerTaglineOne":"Hello 👋",
"headerTaglineTwo":"I'm Tinodaishe Simbanegavi ",
"headerTaglineThree":"A Full-stack developer ",
"headerTaglineFour":" based in Johannesburg, South Africa",
"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/TopDogAlpha7"},
{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/tinodaishe-simbanegavi-3897ba218/"},
{"id":"3","title":"Twitter","link":"https://twitter.com/TopDogAlpha7"},
{"id":"5","title":"Email","link":"mailto:tinodaishesimba@gmail.com"}],


"projects":[{"id":"1","title":"Landing page","description":"Nextjs 13",
"imageSrc":"https://images.unsplash.com/photo-1487837647815-bbc1f30cd0d2?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njl8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://650459c39e34cd21b08bfd51--rujembe.netlify.app/"},
{"id":"2","title":"Engineer Bookings","description":"Nextjs 13","imageSrc":"https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60","url":"https://topdogalpha7.github.io/engineer-bookings/"},
{"id":"3","title":"eCommerce App","description":"Angular","imageSrc":"https://images.unsplash.com/photo-1504083898675-c896ecdae86e?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjJ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://github.com/TopDogAlpha7/ecommerce-app-angular"},
{"id":"4","title":"Todo-List","description":"Angular","imageSrc":"https://images.unsplash.com/photo-1492171983775-a51717616c0d?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjB8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://github.com/TopDogAlpha7/todo-list-angular"}],
"services":[{"id":"1","title":"Smart Contract Development",
"description":"I specialize in smart contract development, crafting secure and efficient decentralized solutions that harness the power of blockchain technology. With a deep understanding of Solidity, Truffle, and Ethereum's ecosystem, I can bring your blockchain projects to life, whether it's for DeFi platforms, NFT marketplaces, or supply chain solutions."},
{"id":"2","title":"Copywriting","description":"I provide professional copywriting services that breathe life into your ideas and captivate your audience. Whether you need compelling marketing materials, engaging website content, or persuasive product descriptions, my words are crafted to resonate with your target audience and convey your message effectively. "},
{"id":"3","title":"Web Design","description":"I offer expert web design services that transform your online presence into a visual masterpiece. With a keen eye for aesthetics and a strong grasp of user experience, I create captivating and responsive designs that reflect your brand's unique identity. "},
{"id":"4","title":"Web Development","description":"I specialize in web development services, turning your digital visions into functional realities. With a robust command of the latest web technologies and programming languages, I craft dynamic and user-friendly websites and web applications that align with your unique objectives."}],
"aboutpara":
"👋 Hey, I'm Tinodaishe Simbanegavi! I'm a self-taught full-stack developer with a year of hands-on experience in software development and web development. My journey into the world of coding has been a thrilling self-discovery, and it's just the beginning of a lifelong quest to master the ever-evolving tech landscape. My true passion is blockchain development and this was born after I discovered smart contracts and DeFi. What excites me most is the potential of blockchain and Web3 technology to revolutionize industries and the way we interact with data. I'm on a mission to leverage my skills to contribute to this transformative wave.",
"aboutpara1": "Throughout my journey, I've wholeheartedly immersed myself in the ever-evolving world of web development. With an unwavering passion for honing my skills, I've acquired deep expertise in not one but two powerful tech stacks – MERN (MongoDB, Express.js, React, Node.js) and MEAN (MongoDB, Express.js, Angular, Node.js). This dynamic duo of tech stacks has become the foundation of my development toolkit, allowing me to create versatile, high-performing web applications with finesse. Beyond conventional web development, I've also ventured into the realm of web scraping. It's a fascinating discipline that involves extracting data from various online sources and transforming it into valuable insights.",
"aboutpara2": "My enthusiasm for technology and its limitless potential is not just a personal pursuit; it's a beacon that guides me towards like-minded individuals and teams who share the same passion. I firmly believe that innovation flourishes when bright minds come together, and I'm all in for that collaborative spirit.",

"resume":{"tagline":"👋  I'm a full-stack developer.",
"description":"I have delivered world-class user experiences to millions of people. Well-versed with React, Javascript, and most of the Web frameworks.",
"experiences":[{"id":"1","dates":"September 2023 - Present","type":"Full Time","position":"Frontend Developer at Neo Breed Marketing Solutions",
"bullets":"Collaborate with designers and back-end develoopers to implement website designs: Write clean, efficient and well documented HTML, CSS and JavaScript code: Ensure websites are visually appealing, responsive and optimized for various devices: Conduct testing and debugging to identify and resolve front-end issues"},
{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725",
"dates":"June 2023 - September 2023",
"type":"Internship",
"position":"Junior Frontend Developer at KaribuTech AI",
"bullets":"Tasked with building responsive and interactive user inWorked on the frontend of a React applicationterfaces using web technologies such as HTML, CSS, Tailwind CSS, Raect, Nextjs, Angular, MongoDB and JavaScript and ensuring cross-browser compatability and optimal performance: Collaborate with designers, back-end developers and other team members to brainstorm ideas, define project requirements and ensure smooth integration of front-end and back-end technologies."}],
"education":{"universityName":"Edenglen High School","universityDate":"2017-2021","universityPara":"I attended Edenglen High School, a renowned educational institution where I pursued a well-rounded curriculum that laid the foundation for my academic and personal growth. During my high school years, I engaged in a diverse range of subjects, including English, Mathematics, Afrikaans FAL, Life Orientation, Physical Sciences, Computer Applications and Technology and Engineering Graphics and Design. The rigorous coursework and dedicated teachers at Edenglen High School not only provided me with a comprehensive education but also instilled in me a strong work ethic and a commitment to excellence. I am proud to note that I matriculated with one distinction, which reflects my dedication to academic achievement and my ability to excel in a competitive academic environment."},
"languages":["JavaScript","HTML5","CSS","Python","Solidity","TypeScript"],
"frameworks":["React","NodeJs","Angular","Truffle","NextJS","Tailwind CSS","Express.js","MongoDB","Ethers.js"],
"others":["Figma","AWS","Webflow","GoDaddy","Github"]}}